socialNetwork/wrk2/outs/c10_r10.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.258ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.303ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.09ms  720.37us   6.08ms   84.17%
    Req/Sec     5.64     24.24   111.00     94.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.94ms
 75.000%    3.31ms
 90.000%    3.76ms
 99.000%    6.08ms
 99.900%    7.67ms
 99.990%   10.53ms
 99.999%   10.53ms
100.000%   10.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.181     0.000000            1         1.00
       2.425     0.100000           54         1.11
       2.625     0.200000          108         1.25
       2.741     0.300000          162         1.43
       2.849     0.400000          217         1.67
       2.941     0.500000          269         2.00
       3.009     0.550000          296         2.22
       3.061     0.600000          323         2.50
       3.131     0.650000          350         2.86
       3.207     0.700000          379         3.33
       3.311     0.750000          403         4.00
       3.383     0.775000          417         4.44
       3.453     0.800000          430         5.00
       3.497     0.825000          446         5.71
       3.551     0.850000          457         6.67
       3.653     0.875000          470         8.00
       3.709     0.887500          477         8.89
       3.765     0.900000          484        10.00
       3.855     0.912500          491        11.43
       3.965     0.925000          497        13.33
       4.077     0.937500          504        16.00
       4.115     0.943750          507        17.78
       4.183     0.950000          511        20.00
       4.299     0.956250          514        22.86
       4.371     0.962500          517        26.67
       4.483     0.968750          521        32.00
       4.583     0.971875          522        35.56
       4.631     0.975000          524        40.00
       4.867     0.978125          526        45.71
       4.895     0.981250          527        53.33
       5.415     0.984375          529        64.00
       5.555     0.985938          530        71.11
       5.671     0.987500          531        80.00
       6.079     0.989062          532        91.43
       6.079     0.990625          532       106.67
       6.395     0.992188          533       128.00
       6.647     0.992969          534       142.22
       6.647     0.993750          534       160.00
       7.007     0.994531          535       182.86
       7.007     0.995313          535       213.33
       7.007     0.996094          535       256.00
       7.667     0.996484          536       284.44
       7.667     0.996875          536       320.00
       7.667     0.997266          536       365.71
       7.667     0.997656          536       426.67
       7.667     0.998047          536       512.00
      10.527     0.998242          537       568.89
      10.527     1.000000          537          inf
#[Mean    =        3.092, StdDeviation   =        0.720]
#[Max     =       10.520, Total count    =          537]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  651 requests in 1.00m, 164.13KB read
  Socket errors: connect 0, read 0, write 0, timeout 35
  Non-2xx or 3xx responses: 651
Requests/sec:     10.85
Transfer/sec:      2.73KB