socialNetwork/wrk2/outs/c10_r100.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.700ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.809ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.91ms    1.12ms   7.43ms   90.56%
    Req/Sec    51.02     62.10   230.00     84.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.63ms
 75.000%    3.09ms
 90.000%    3.89ms
 99.000%    7.43ms
 99.900%   14.50ms
 99.990%   20.51ms
 99.999%   20.51ms
100.000%   20.51ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.820     0.000000            1         1.00
       2.157     0.100000          500         1.11
       2.289     0.200000          997         1.25
       2.405     0.300000         1489         1.43
       2.515     0.400000         1986         1.67
       2.629     0.500000         2489         2.00
       2.689     0.550000         2730         2.22
       2.755     0.600000         2978         2.50
       2.841     0.650000         3223         2.86
       2.943     0.700000         3474         3.33
       3.093     0.750000         3720         4.00
       3.169     0.775000         3844         4.44
       3.263     0.800000         3969         5.00
       3.371     0.825000         4092         5.71
       3.507     0.850000         4218         6.67
       3.679     0.875000         4340         8.00
       3.773     0.887500         4401         8.89
       3.893     0.900000         4463        10.00
       4.017     0.912500         4525        11.43
       4.175     0.925000         4587        13.33
       4.391     0.937500         4649        16.00
       4.479     0.943750         4681        17.78
       4.611     0.950000         4712        20.00
       4.807     0.956250         4743        22.86
       4.999     0.962500         4773        26.67
       5.235     0.968750         4804        32.00
       5.371     0.971875         4819        35.56
       5.631     0.975000         4835        40.00
       5.911     0.978125         4850        45.71
       6.211     0.981250         4867        53.33
       6.603     0.984375         4881        64.00
       6.823     0.985938         4889        71.11
       7.131     0.987500         4897        80.00
       7.331     0.989062         4904        91.43
       7.591     0.990625         4912       106.67
       8.099     0.992188         4920       128.00
       8.399     0.992969         4924       142.22
       8.663     0.993750         4928       160.00
       8.887     0.994531         4931       182.86
       9.087     0.995313         4935       213.33
       9.575     0.996094         4939       256.00
      10.855     0.996484         4941       284.44
      11.207     0.996875         4943       320.00
      11.287     0.997266         4945       365.71
      11.671     0.997656         4947       426.67
      11.791     0.998047         4949       512.00
      11.863     0.998242         4950       568.89
      12.455     0.998437         4951       640.00
      13.263     0.998633         4952       731.43
      14.503     0.998828         4953       853.33
      14.943     0.999023         4954      1024.00
      14.943     0.999121         4954      1137.78
      15.607     0.999219         4955      1280.00
      15.607     0.999316         4955      1462.86
      16.295     0.999414         4956      1706.67
      16.295     0.999512         4956      2048.00
      16.295     0.999561         4956      2275.56
      16.479     0.999609         4957      2560.00
      16.479     0.999658         4957      2925.71
      16.479     0.999707         4957      3413.33
      16.479     0.999756         4957      4096.00
      16.479     0.999780         4957      4551.11
      20.511     0.999805         4958      5120.00
      20.511     1.000000         4958          inf
#[Mean    =        2.912, StdDeviation   =        1.116]
#[Max     =       20.496, Total count    =         4958]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5992 requests in 1.00m, 1.48MB read
  Non-2xx or 3xx responses: 5992
Requests/sec:     99.85
Transfer/sec:     25.19KB