socialNetwork/wrk2/outs/c10_r1000.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 29.031ms, rate sampling interval: 123ms
  Thread calibration: mean lat.: 22.688ms, rate sampling interval: 122ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    44.54ms  115.31ms 490.24ms   92.37%
    Req/Sec   474.97    129.61   713.00     82.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.45ms
 75.000%   29.49ms
 90.000%  114.05ms
 99.000%  490.24ms
 99.900%    1.40s 
 99.990%    1.99s 
 99.999%    2.15s 
100.000%    2.15s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.630     0.000000            1         1.00
       2.103     0.100000         4735         1.11
       2.913     0.200000         9473         1.25
       4.065     0.300000        14196         1.43
       5.751     0.400000        18935         1.67
       8.447     0.500000        23668         2.00
      10.423     0.550000        26027         2.22
      13.103     0.600000        28392         2.50
      16.687     0.650000        30760         2.86
      21.887     0.700000        33123         3.33
      29.487     0.750000        35484         4.00
      34.687     0.775000        36668         4.44
      41.631     0.800000        37854         5.00
      50.975     0.825000        39037         5.71
      63.167     0.850000        40217         6.67
      81.599     0.875000        41399         8.00
      95.999     0.887500        41990         8.89
     114.047     0.900000        42582        10.00
     136.959     0.912500        43175        11.43
     163.583     0.925000        43766        13.33
     195.583     0.937500        44357        16.00
     211.839     0.943750        44653        17.78
     228.351     0.950000        44947        20.00
     249.087     0.956250        45243        22.86
     281.599     0.962500        45539        26.67
     315.135     0.968750        45835        32.00
     333.823     0.971875        45984        35.56
     353.791     0.975000        46133        40.00
     387.327     0.978125        46278        45.71
     413.695     0.981250        46425        53.33
     443.647     0.984375        46573        64.00
     462.591     0.985938        46648        71.11
     474.367     0.987500        46722        80.00
     482.815     0.989062        46796        91.43
     497.919     0.990625        46869       106.67
     515.583     0.992188        46943       128.00
     520.703     0.992969        46982       142.22
     531.967     0.993750        47017       160.00
     556.031     0.994531        47054       182.86
     592.383     0.995313        47091       213.33
     749.055     0.996094        47128       256.00
     957.951     0.996484        47146       284.44
    1094.655     0.996875        47165       320.00
    1130.495     0.997266        47183       365.71
    1158.143     0.997656        47202       426.67
    1179.647     0.998047        47220       512.00
    1209.343     0.998242        47229       568.89
    1279.999     0.998437        47239       640.00
    1297.407     0.998633        47248       731.43
    1334.271     0.998828        47257       853.33
    1396.735     0.999023        47266      1024.00
    1456.127     0.999121        47271      1137.78
    1484.799     0.999219        47276      1280.00
    1524.735     0.999316        47280      1462.86
    1585.151     0.999414        47285      1706.67
    1603.583     0.999512        47289      2048.00
    1641.471     0.999561        47292      2275.56
    1675.263     0.999609        47294      2560.00
    1702.911     0.999658        47296      2925.71
    1753.087     0.999707        47299      3413.33
    1816.575     0.999756        47301      4096.00
    1827.839     0.999780        47302      4551.11
    1881.087     0.999805        47303      5120.00
    1901.567     0.999829        47304      5851.43
    1926.143     0.999854        47306      6826.67
    1993.727     0.999878        47307      8192.00
    1993.727     0.999890        47307      9102.22
    2060.287     0.999902        47308     10240.00
    2060.287     0.999915        47308     11702.86
    2075.647     0.999927        47309     13653.33
    2093.055     0.999939        47310     16384.00
    2093.055     0.999945        47310     18204.44
    2093.055     0.999951        47310     20480.00
    2093.055     0.999957        47310     23405.71
    2131.967     0.999963        47311     27306.67
    2131.967     0.999969        47311     32768.00
    2131.967     0.999973        47311     36408.89
    2131.967     0.999976        47311     40960.00
    2131.967     0.999979        47311     46811.43
    2150.399     0.999982        47312     54613.33
    2150.399     1.000000        47312          inf
#[Mean    =       44.543, StdDeviation   =      115.313]
#[Max     =     2148.352, Total count    =        47312]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  57230 requests in 1.00m, 14.13MB read
  Non-2xx or 3xx responses: 57230
Requests/sec:    953.69
Transfer/sec:    241.08KB