socialNetwork/wrk2/outs/c10_r2000.out
Running 1m test @ http://10.101.21.23:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.87s     8.58s   50.76s    77.78%
    Req/Sec     0.19      4.96     0.00     99.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.80s 
 75.000%   41.94s 
 90.000%   48.46s 
 99.000%   50.76s 
 99.900%   50.76s 
 99.990%   50.76s 
 99.999%   50.76s 
100.000%   50.76s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   15761.407     0.000000            1         1.00
   27901.951     0.100000            2         1.11
   30146.559     0.200000            4         1.25
   30654.463     0.300000            6         1.43
   30801.919     0.400000            9         1.67
   30801.919     0.500000            9         2.00
   32096.255     0.550000           10         2.22
   34963.455     0.600000           11         2.50
   35094.527     0.650000           12         2.86
   35586.047     0.700000           13         3.33
   41943.039     0.750000           15         4.00
   41943.039     0.775000           15         4.44
   41943.039     0.800000           15         5.00
   41943.039     0.825000           15         5.71
   48463.871     0.850000           16         6.67
   48463.871     0.875000           16         8.00
   48463.871     0.887500           16         8.89
   50069.503     0.900000           17        10.00
   50069.503     0.912500           17        11.43
   50069.503     0.925000           17        13.33
   50069.503     0.937500           17        16.00
   50069.503     0.943750           17        17.78
   50757.631     0.950000           18        20.00
   50757.631     1.000000           18          inf
#[Mean    =    34866.290, StdDeviation   =     8583.515]
#[Max     =    50724.864, Total count    =           18]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18 requests in 1.00m, 4.57KB read
  Socket errors: connect 0, read 0, write 0, timeout 284
  Non-2xx or 3xx responses: 18
Requests/sec:      0.30
Transfer/sec:      77.95B